
-- 获取病人未执行医嘱项目
EXEC usp_yjjk_getwzxxm  '3', '-1', '8000211000', '2024012300:00:00', '2026012223:59:59', '0', '0'

-- 读取病人基本信息
EXEC usp_yjjk_getbrxx  '3', '2', '8000211000', '0'

-- 修改报告状态
EXEC usp_yjjk_bgztxg  '3', '26020200001', '26020200001', '479814', '0', '0', '60', '-1', '0', '89', 'LIS', '800000000003T'

-- 检查病人发布
EXEC usp_yjjk_jcbrfb  '24781501', '0', '26012900001', '26012900001', '26012900001', '', '测试003', '1', '33', '632', '山西省肿瘤体检中心', '', '', '', '00001', '00001', '2026012910:01:43', '101', '血液', '2026013016:35:46', '3', '全血', '479814', '管理员', '19', '检验科', '0', '1', 'SYSME-XN1000血液分析仪A', '1', '2026013016:25:48', '管理员', '0', '479814', '2026013016:25:48', ''

-- 结果发布
EXEC usp_yjjk_yjjgfb  'LIS', '3', '26020900002', '93', '101', '血液', '10100001', '白细胞计数', '1.00', '19', '479814', '2026021216:15:44', '*10^9/L', '1', '4.10～11.00', '1', 'Z0001', '24781501', '0'

EXEC usp_yjjk_jg_huishou  '-1', '101', 'LIS'

EXEC usp_yjjk_getbrlist '','','','','','2024011012:00:00','','','1','',''

exec usp_yjjk_getsqdlist 3,'','','','','','','','','','2021121212:00:00','',''

-- 结果发布
EXEC usp_yjjk_yjjgfb  'LIS', '3', '26020900002', '93', '101', '血液', '10100001', '白细胞计数', '1.00', '19', '479814', '2026021216:15:44', '*10^9/L', '1', '4.10～11.00', '1', 'Z0001', '24781501', '0'

select * from InterfaceCallLog icl 

delete from InterfaceCallLog

SELECT * from interface_state t 

select applyId,barCode  ,* FROM  VocaPatientFeeItem

select * from VocaPatient vp left join VocaPatientFeeItem vpfi on vp.ID_Patient =vpfi.ID_Patient where vp.PatientCode ='26020200001'